// задачи

//-----------------------часть 1---------------------------
// Дана некоторая строка. Найдите позицию первого нуля в строке.
// Выведите в консоль все числа в промежутке от 1 до 1000, сумма первой и второй цифры которых равна пяти.
// Дан массив. Удалите из него элементы с заданным значением.
// Дан некоторый массив, например, вот такой:[1, 2, 3, 4, 5, 6]Найдите сумму первой половины элементов этого массива.


//-----------------------часть 2---------------------------
// Дан массив с числами. Подсчитайте количество отрицательных чисел в этом массиве.
// Дан массив с числами. Оставьте в нем только положительные числа.
// Дана строка. Удалите предпоследний символ из этой строки.
//Дан некоторый массив, например, вот такой [1, 2, 3, 4, 5, 6] Поделите сумму первой половины элементов этого массива на сумму второй половины элементов.