// задачи

//-----------------------часть 1---------------------------
// Дана некоторая строка. Найдите позицию первого нуля в строке.
// Выведите в консоль все числа в промежутке от 1 до 1000, сумма первой и второй цифры которых равна пяти.
// Дан массив. Удалите из него элементы с заданным значением.
// Дан некоторый массив, например, вот такой:[1, 2, 3, 4, 5, 6]Найдите сумму первой половины элементов этого массива.


//-----------------------часть 2---------------------------
// Дан массив с числами. Подсчитайте количество отрицательных чисел в этом массиве.
// Дан массив с числами. Оставьте в нем только положительные числа.
// Дана строка. Удалите предпоследний символ из этой строки.
//Дан некоторый массив, например, вот такой [1, 2, 3, 4, 5, 6] Поделите сумму первой половины элементов этого массива на сумму второй половины элементов.

//-----------------------часть 3---------------------------
// Даны два слова. Проверьте, что последняя буква первого слова совпадает с первой буквой второго слова.
// Дана некоторая строка. Найдите позицию третьего нуля в строке.
// Даны числа, разделенные запятыми:'12,34,56' Найдите сумму этих чисел.
//Дана дата в следующем формате:'2025-12-31'Преобразуйте эту дату в следующий объект:{	year: '2025',	month: '12',	day: '31',}

//-----------------------часть 4-------------------------
// Дана некоторая строка с буквами и цифрами. Получите позицию первой цифры в этой строке.
// Дан объект с ключами и значениями. Запишите в первый массив ключи объекта, а во второй - значения.
// Дано число. Выведите в консоль количество четных цифр в этом числе.
// Дана некоторая строка:'abcde'Переведите в верхний регистр все нечетные буквы этой строки. В нашем случае должно получится следующее: 'AbCdE'
//'aaa bbb ccc'Сделайте заглавным первый символ каждого слова в этой строке. В нашем случае должно получится следующее: 'Aaa Bbb Ccc'